#include <stdio.h>
#include "sf_device.h"
#include "esp_log.h"


static const char* TAG = "SIMFLOW_MAIN";

void print_Logo()
{
     const char *banner[] = {
        "+---------------------------------------------------------------------+",
        "|                                                                     |",
        "|                                                                     |",
        "|   ███████╗██╗███╗   ███╗      ███████╗██╗      ██████╗ ██╗    ██╗   |",
        "|   ██╔════╝██║████╗ ████║      ██╔════╝██║     ██╔═══██╗██║    ██║   |",
        "|   ███████╗██║██╔████╔██║█████╗█████╗  ██║     ██║   ██║██║ █╗ ██║   |",
        "|   ╚════██║██║██║╚██╔╝██║╚════╝██╔══╝  ██║     ██║   ██║██║███╗██║   |",
        "|   ███████║██║██║ ╚═╝ ██║      ██║     ███████╗╚██████╔╝╚███╔███╔╝   |",
        "|   ╚══════╝╚═╝╚═╝     ╚═╝      ╚═╝     ╚══════╝ ╚═════╝  ╚══╝╚══╝    |",
        "|                                                                     |",
        "|                                                                     |",
        "+---------------------------------------------------------------------+"
    };

    // Calculate number of lines dynamically
    int lines = sizeof(banner) / sizeof(banner[0]);

    // Loop to print each line of the banner
    for (int i = 0; i < lines; i++) {
        printf("%s\n", banner[i]);
    }
}

void app_main(void)
{
    print_Logo();

    sf_device_cfg_t dev_cfg = {0}; 

    init_device(dev_cfg);
    ESP_LOGI(TAG, "************************ SIM FLOW INIT DONE ************************");

    device_start();
}